cf_billing/InformationRegisters/энргДниНачалаНачисленияПоСреднему.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДниНачалаНачисленияПоСреднему</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДниНачалаНачисленияПоСреднему/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет дни начала начисления по среднему.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция ДниНачалаНачисленияПоСреднему(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаДниНачалаНачисленияПоСреднему());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргДниНачалаНачисленияПоСреднемуСрезПоследних",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ОпределитьВозможностьНачислятьСреднее") Тогда
		Если ПараметрыОтбора.ОпределитьВозможностьНачислятьСреднее Тогда                   
			Выражение	= "ВЫБОР
			|		КОГДА &ТекущаяДата > ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ПериодНачисления, МЕСЯЦ), День, " + Источник.Псевдоним + ".День) 
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ";
		Иначе
			Выражение	= "ИСТИНА";
		КонецЕсли;
		ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		Пакет.Колонки[Пакет.Колонки.Количество() - 1].Псевдоним = "МожноНачислятьСреднее";
		
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает текст запроса дни начала начисления по среднему.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаДниНачалаНачисленияПоСреднему() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргДниНачалаНачисленияПоСреднемуСрезПоследних.Организация КАК Организация,
	|	энргДниНачалаНачисленияПоСреднемуСрезПоследних.День КАК День
	|ИЗ
	|	РегистрСведений.энргДниНачалаНачисленияПоСреднему.СрезПоследних КАК энргДниНачалаНачисленияПоСреднемуСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
